import 'package:app/pages/map/point.dart';
import 'package:latlong2/latlong.dart';

///   Types
/// 1 - Hospital
/// 2 - Shop
/// 3 - Park

const _points = [
  ['0', '1', 'Ветеринарна клиника ArenaVet', 'ж.к. Меден рудник 361, 8011 Меден Рудник, Бургас', '42.463286562929824', '27.413205105891176'],
  ['1', '1', 'ВЕТЕРИНАРНА КАБИНЕТ "КОАЛА"', 'ж.к. Меден рудник 244, 8011 Меден Рудник, Бургас', '42.45950136285772', '27.413188564786022'],
  ['2', '1', 'Ветеринар', 'ж.к. Меден рудник 355, 8011 Меден Рудник, Бургас', '42.46159690755076', '27.412793587965492'],
  ['3', '1', 'Ветеринарна клиника Vet plus', 'ж.к. Меден рудник 516, 8011 Меден Рудник, Бургас', '42.45458751535946', '27.41747692604481'],
  ['4', '2', 'Зоомагазин Пламена', 'Бургас кс, ж.к. Меден рудник 551, 8012 Бургас', '42.4503678621161', '27.417906107968225'],
  ['5', '2', 'Зоомагазин Шампион', 'ул. „Тракиец“ 34, 8009 Меден Рудник, Бургас', '42.45821278824417', '27.413416722212272'],
  ['6', '2', 'Зоомагазин Тренди-Еврозоовет', '8000, ж.к. Меден рудник 278, 8008 Бургас', '42.4566018217135', '27.41715028402025'],
  ['7', '2', 'Зоомагазин Сириус', 'бул. „Захари Стоянов" 62, 8009 Меден Рудник, Бургас', '42.4606848118274', '27.40809686930021'],
  ['8', '2', 'Зоомагазин "Кари"', 'ул. „Петрова нива“ 11, 8000 Меден Рудник, Бургас', '42.454066849117105', '27.41245223953871'],
  ['9', '3', 'Парк за разходка на кучета', 'ул. „Въстаническа“ 426, 8011 Меден Рудник', '42.46028655910682', '27.422187958609218']
];


List<MapPoint> points = _points.asMap().entries.map((entry) {
  int index = entry.key;
  List<String> categoryLabels = entry.value;

  return MapPoint(
    int.parse(categoryLabels[0]),
    int.parse(categoryLabels[1]),
    '${categoryLabels[2]}',
    '${categoryLabels[3]}',
    'images/vet/${categoryLabels[0].toLowerCase().replaceAll(' ', '_')}.jpg',
    double.parse(categoryLabels[4]),
    double.parse(categoryLabels[5])
  );
}).toList();